# SL_UpdateUID

## Description
Changes an existing UID in the data exchange file.

```pascal
PROCEDURE SL_UpdateUID(
				oldUID : DYNARRAY[] of CHAR;
				newUID : DYNARRAY[] of CHAR);
```

```python
def vs.SL_UpdateUID(oldUID, newUID):
    return None
```

## Parameters
|Name|Type|Description|
|---|---|---|
|oldUID|DYNARRAY[] of CHAR|   |
|newUID|DYNARRAY[] of CHAR|   |

## Version
Availability: from Vectorworks 2012

## Category
* Spotlight